/*
Note for the Localization Engineer:
The strings enclosed within < > should NOT be localized. Eg : <OPERATION>
*/

/* Recovery options for the errors */
TryAgainButtonTitle = "Yritä uudelleen";
CancelButtonTitle = "Peruuta";


/*Error descriptions for corrupted store*/
CorruptedEventStoreDescription = "<OPERATION> koska seuraavaa tiedostoa ei voitu lukea: “/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";

/*Error descriptions for missing store*/
MissingEventStoreDescription = "<OPERATION> koska seuraavaa tiedostoa ei löydy: “/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";


/*Recovery suggestion for corrupted and missing store.*/
MissingEventStoreRecoverySuggesstion = "Korvaa HPEventStore.hpstore-tiedosto, jos olet siirtänyt tai poistanut sen ja napsauta sitten Yritä uudelleen.\rLuo uusi tiedostosta napsauttamalla Luo.";

/* Recovery options for corrupted and missing store */
CreateButtonTitle = "Luo";

/*Error descriptions for permission error*/
EventStorePermissionsErrorDescription = "<OPERATION> koska sovellus ei voi käyttää seuraavaa tiedostoa: “/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";

/* Recovery options for corrupted and missing store */
RepairAccessButtonTitle = "Korjaa oikeudet";

/*Added new key to refer error recovery suggestion if the permission is not proper.*/
EventStorePermissionsErrorRecoverySuggesstion = "Tarkista HPEventStore.hpstore-kohteeseen liittyvät kansiot ja varmista, että niitä ei ole lukittu ja että niiden oikeuksiksi on asetettu ”Luku & kirjoitus” ja napsauta sitten Yritä uudelleen.\rJos haluat sovelluksen yrittävän korjata oikeudet, napsauta Korjaa oikeudet.";

//Error description for out of disk space error
DiskFullErrorDescription = "<OPERATION> koska käynnistyslevyllä ei ole tarpeeksi tilaa.";

//Recover suggestion for out of disk space error
DiskFullErrorRecoverySuggesstion = "Poista levyltä joitakin tiedostoja ja napsauta sitten Yritä uudelleen.";
